'use client';

import { useRef } from 'react';
import { ObstacleProps } from './ObstacleProps';

export const useObstaclesSlider = () => {
    const swiperRef = useRef<any>(null);

    const obstacles: ObstacleProps[] = [
        {
            icon: '/imgs/plan.png',
            title: 'نداشتن برنامه برای رشد',
            description:
                'اگر استراتژی مشخصی برای رشد ندارید، پرشین سایت نقشه راه جامعی برای شما طراحی خواهد کرد.',
        },
        {
            icon: '/imgs/budget.png',
            title: 'دغدغه هدر رفتن بودجه',
            description:
                'اگر نگران عدم کسب نتیجه هستید، پرشین سایت با برنامه‌ریزی دقیق به شما اطمینان می‌دهد که از بودجه خود به بهترین نحو استفاده خواهید کرد.',
        },
        {
            icon: '/imgs/adv.png',
            title: 'عدم تخصص تیم در تبلیغات',
            description:
                'اگر تیم شما تجربه کافی در زمینه تبلیغات ندارد، ما تمامی فرآیندها را به صورت حرفه‌ای و با کیفیت بالا انجام خواهیم داد.',
        },
        {
            icon: '/imgs/strategy.png',
            title: 'نبود استراتژی مشخص',
            description:
                'نگران هماهنگی با اهداف کسب‌وکار خود نباشید؛ پرشین سایت برنامه‌ای متناسب با نیازهای شما طراحی خواهد کرد.',
        },
        {
            icon: '/imgs/expertise.png',
            title: 'نا‌آگاهی از تأثیر تبلیغات',
            description:
                'بسیاری از افراد نمی‌دانند که کمپین‌های تبلیغاتی چگونه می‌توانند منجر به افزایش فروش شوند؛ ما این تأثیرات را به وضوح برای شما نمایش خواهیم داد.',
        },
        {
            icon: '/imgs/time.png',
            title: 'تصور زمان‌بر بودن نتایج',
            description:
                'برخی از افراد نگران این هستند که نتایج تبلیغات دیر به دست آید، در حالی که پرشین سایت با سرعت بالا، شما را در دستیابی به نتایج مطلوب یاری می‌کند.',
        },
        {
            icon: '/imgs/complexity.png',
            title: 'ترس از پیچیدگی مدیریت',
            description:
                'مدیران ممکن است نگران دشواری مدیریت کمپین‌ها باشند، اما ما تمامی فرآیندها را به ساده‌ترین شکل ممکن ارائه می‌دهیم.',
        },
        {
            icon: '/imgs/cost.png',
            title: 'نگرانی از هزینه‌های تبلیغات',
            description:
                'برخی افراد ممکن است تصور کنند که تبلیغات هزینه‌بر است؛ اما پرشین سایت با ارائه سود بالا، این هزینه‌ها را جبران می‌کند.',
        },
    ];

    return { swiperRef, obstacles };
};
